[
  {
    "name": "WPI_Number",
    "mode": "REQUIRED",
    "type": "STRING",
    "description": "Each port and place contained in this dataset is given a unique number by the publisher. WPI numbers remain consistent between updates and are also referenced in NGA Sailing Directions.",
    "fields": []
  },
  {
    "name": "Region_Name",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Region Names, as given in the 2019 edition of the World Port Index, are included.",
    "fields": []
  },
  {
    "name": "Main_Port_Name",
    "mode": "REQUIRED",
    "type": "STRING",
    "description": "Main Port Name, with no diacritical marks. In general, port names listed are approved by the U.S. Board on Geographic Names.",
    "fields": []
  },
  {
    "name": "Alternate_Port_Name",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Alternate, conventional, or familiar names may be included here.",
    "fields": []
  },
  {
    "name": "UN_LOCODE",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Given in accordance with the United Nations Code for Trade and Transport Locations.",
    "fields": []
  },
  {
    "name": "Country_Code",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Country name according to U.S. Government's Geopolitical Entities, Names, and Codes (GENC) standard.",
    "fields": []
  },
  {
    "name": "World_Water_Body",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The relevant body of water, as defined by the United States Department of Defense.",
    "fields": []
  },
  {
    "name": "Sailing_Direction_or_Publication",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The publication number and title of the NGA Sailing Directions, describing the port or area in which the port is located, are normally given. For ports in other areas, other publications are given, including United States Coast Pilot (all volumes) and United Kingdom Hydrographic Office Black Sea and Sea of Azov Pilot.",
    "fields": []
  },
  {
    "name": "Publication_Link",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "A link to the online publication is provided.",
    "fields": []
  },
  {
    "name": "Standard_Nautical_Chart",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The number of the best-scale chart issued by NGA is listed with no prefix.",
    "fields": []
  },
  {
    "name": "IHO_S_57_Electronic_Navigational_Chart",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The number/name of the appropriate electronic navigational chart in the S-57 format is given.",
    "fields": []
  },
  {
    "name": "IHO_S_101_Electronic_Navigational_Chart",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The number/name of the appropriate electronic navigational chart in the S-101 format is given.",
    "fields": []
  },
  {
    "name": "Digital_Nautical_Chart",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "NGA Digital Nautical Chart library numbers are given.",
    "fields": []
  },
  {
    "name": "Tidal_Range__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The mean range in meters is given for all ports. The mean rise is substituted if range data is not available. The distinction between range and rise can be disregarded without affecting the general utility of this Index.",
    "fields": []
  },
  {
    "name": "Entrance_Width__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The maximum width of the entrance is given, where restrictions exist.",
    "fields": []
  },
  {
    "name": "Channel_Depth__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The controlling depth of the principal or deepest channel at chart datum is given. The channel selected should lead up to the anchorage if within the harbor, or to the wharf/pier. If the channel depth decreases from the anchorage to the wharf/pier and cargo can be worked at the anchorage, then the depth leading to the anchorage is given.",
    "fields": []
  },
  {
    "name": "Anchorage_Depth__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The depth in the anchorage is the least depth in the best or principal anchorage. The depth listed reflects a general depth in the anchorage rather than an isolated shoal spot. A shoal which does not necessarily obstruct the anchorage is not considered for the least depth if the rest of the anchorage is safe and practicable.",
    "fields": []
  },
  {
    "name": "Cargo_Pier_Depth__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The greatest depth at chart datum alongside the respective wharf/pier is given. If there is more than one wharf/pier, the one which has the greatest usable depth is shown. For example, if there are three cargo/container piers with depths of 7.0 meters, 10.1 meters, and 13.1 meters, then the deepest depth of 13.1 meters would be entered into the Index.",
    "fields": []
  },
  {
    "name": "Oil_Terminal_Depth__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The greatest depth at chart datum will be shown. Note: an oil terminal is a facility designed to conduct the loading and/or offloading of crude oil or refined petroleum products. The terminal can be associated with a port or can be a standalone facility. Generally, the terminal is offshore and is connected to the shore facilities by a pipeline. The offshore part may be an extended pier, SBM, buoy field, platform, or storage tanker. Many ports have piers and/or wharves with facilities for refueling vessels. The oil terminal is distinguished by being specifically for oil transfer operations and nothing else (repairs alongside and cargo operations not permitted).",
    "fields": []
  },
  {
    "name": "Liquified_Natural_Gas_Terminal_Depth__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The greatest depth at chart datum will be shown. Note: LNG terminals are normally located away from other port operations and operate under an expanded set of safety regulations.",
    "fields": []
  },
  {
    "name": "Maximum_Vessel_Length__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The maximum length that can be accommodated in the port is given.",
    "fields": []
  },
  {
    "name": "Maximum_Vessel_Beam__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The maximum beam that can be accommodated in the port is given.",
    "fields": []
  },
  {
    "name": "Maximum_Vessel_Draft__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The maximum draft that can be accommodated in the port is given.",
    "fields": []
  },
  {
    "name": "Offshore_Maximum_Vessel_Length__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The maximum length that can be accommodated offshore is given.",
    "fields": []
  },
  {
    "name": "Offshore_Maximum_Vessel_Beam__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The maximum beam that can be accommodated offshore is given.",
    "fields": []
  },
  {
    "name": "Offshore_Maximum_Vessel_Draft__m_",
    "mode": "NULLABLE",
    "type": "FLOAT",
    "description": "The maximum draft that can be accommodated offshore is given.",
    "fields": []
  },
  {
    "name": "Harbor_Size",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The classification of harbor size -- Large, Medium, Small, or Very Small -- is based on several applicable factors, including area, facilities, and wharf space. It is not based on area alone or on any other single factor.",
    "fields": []
  },
  {
    "name": "Harbor_Type",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The term \"harbor\" is used for the principal water area of the port. Harbors are classified as: Coastal (Natural), Coastal (Breakwater), Coastal (Tide Gates), River (Natural), River (Basin), River (Tide Gates), Canal or Lake, or Open Roadstead.",
    "fields": []
  },
  {
    "name": "Harbor_Use",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Harbor use is classified as Fishing, Military, Cargo, Ferry, or Unknown.",
    "fields": []
  },
  {
    "name": "Shelter_Afforded",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The shelter afforded from wind, sea, and swell refers to the area where normal port operations are conducted, usually the wharf area. Shelter afforded by the anchorage area may be given for ports where cargo is handled by lighters. Values given are Excellent, Good, Fair, Poor, or None.",
    "fields": []
  },
  {
    "name": "Entrance_Restriction___Tide",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Natural factor restricting the entrance of vessels -- Tide. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Entrance_Restriction___Heavy_Swell",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Natural factor restricting the entrance of vessels -- Heavy Swell. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Entrance_Restriction___Ice",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Natural factor restricting the entrance of vessels -- Ice. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Entrance_Restriction___Other",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Natural factor restricting the entrance of vessels -- Other. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Overhead_Limits",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "This entry is shown only to indicate that bridge and overhead power cables exist. It is advisable to refer to the chart for particulars. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Underkeel_Clearance_Management_System",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether an Underkeel Clearance Management System is in place in the port or its approaches. Values are Static, Dynamic, None, or Unknown.",
    "fields": []
  },
  {
    "name": "Good_Holding_Ground",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "This is indicated only where actual anchorage conditions have been reported. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Turning_Area",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "An indication that a turning basin or other water area for turning vessels is available in the port. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Port_Security",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether International Ship and Port Facility Security (ISPS) safety regulations will apply in the port. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Estimated_Time_of_Arrival_Message",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether an ETA message is required for that port. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Quarantine___Pratique",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether pratique will apply to vessels arriving in the port. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Quarantine___Sanitation",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether sanitation will apply to vessels arriving in the port. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Quarantine___Other",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether other restrictions will apply to vessels arriving in the port. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Traffic_Separation_Scheme",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates if a Traffic Separation Scheme is established in the approach to the port.",
    "fields": []
  },
  {
    "name": "Vessel_Traffic_Service",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates that a Vessel Traffic Service is established in the approach to the port. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "First_Port_of_Entry",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "A port where a vessel may enter and clear foreign goods and personnel through Customs and Immigration. For vessels arriving from overseas, a quarantine clearance is required by the First Port of Entry. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "US_Representative",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether the United States maintains civilian/military representation in that port. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Pilotage___Compulsory",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The necessity or availability of taking a pilot is given. In some cases, pilots are not actually stationed at the port in question and must be obtained elsewhere. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Pilotage___Available",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The necessity or availability of taking a pilot is given. In some cases, pilotage may be compulsory, although pilots are not actually stationed at the port in question and must be obtained elsewhere. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Pilotage___Local_Assistance",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The availability of local assistance, as opposed to official pilotage, is given. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Pilotage___Advisable",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The necessity or availability of taking a pilot, even though not compulsory, is given. In some cases, pilotage may be compulsory, although pilots are not actually stationed at the port in question and must be obtained elsewhere. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Tugs___Salvage",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether tugs are available for salvage assistance. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Tugs___Assistance",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether tugs are available for docking or anchorage assistance. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Communications___Telephone",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether telephone communications are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Communications___Telefax",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether telefax communications are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Communications___Radio",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether radio communications are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Communications___Radiotelephone",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether radiotelephone communications are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Communications___Airport",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether airport communications are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Communications___Rail",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether rail communications are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Search_and_Rescue",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether there are Search and Rescue facilities in the port or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "NAVAREA",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The corresponding NAVAREA, as defined in relevant IMO and IHO documentation, is given.",
    "fields": []
  },
  {
    "name": "Facilities___Wharves",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether wharf facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Anchorage",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether anchorage facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Dangerous_Cargo_Anchorage",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether dangerous cargo anchorage facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Med_Mooring",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether med mooring facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Beach_Mooring",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether beach mooring facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Ice_Mooring",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether ice mooring facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Ro_Ro",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether ro-ro facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Solid_Bulk",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether solid bulk facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Liquid_Bulk",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether liquid bulk facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Container",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether container facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Breakbulk",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether breakbulk facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Oil_Terminal",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether oil terminal facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___LNG_Terminal",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether LNG terminal facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Facilities___Other",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether other facilities are available in the port and/or nearby area. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Medical_Facilities",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates that there are some form of medical facilities in the port that will accommodate seamen. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Garbage_Disposal",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether garbage can be disposed of at the pier or by lighters at the anchorage or mooring. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Chemical_Holding_Tank_Disposal",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether Chemical Holding Tanks (black water) can be discharged at the pier or at the anchorage. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Degaussing",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether degaussing facilities are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Dirty_Ballast_Disposal",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Pertains to a port that has sufficient facilities for receiving oily and/or chemically contaminated dirty ballast. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Cranes___Fixed",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether fixed cranes are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Cranes___Mobile",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether mobile cranes are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Cranes___Floating",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether floating cranes are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Cranes___Container",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether container cranes are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Lifts___100__Tons",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates the lifting power in tons of the available cranes. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Lifts___50_100_Tons",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates the lifting power in tons of the available cranes. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Lifts___25_49_Tons",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates the lifting power in tons of the available cranes. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Lifts___0_24_Tons",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates the lifting power in tons of the available cranes. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Services___Longshoremen",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether longshoremen services are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Services___Electricity",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether electricity services are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Services___Steam",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether steam services are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Services___Navigation_Equipment",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether navigation equipment services are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Services___Electrical_Repair",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether electrical repair services are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Services___Ice_Breaking",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether ice breaking services are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Services___Diving",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Indicates whether diving services are available. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Supplies___Provisions",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The availability of provisions is listed. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Supplies___Potable_Water",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The availability of water is listed. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Supplies___Fuel_Oil",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The availability of fuel oil is listed. Fuel and oil types are listed separately, but in cases of original source information failing to distinguish between the two, both kinds are presumed to be available and are so listed. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Supplies___Diesel_Oil",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The availability of diesel oil is listed. Fuel and oil types are listed separately, but in cases of original source information failing to distinguish between the two, both kinds are presumed to be available and are so listed. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Supplies___Aviation_Fuel",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The availability of aviation fuel is listed. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Supplies___Deck",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The availability of deck supplies is listed. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Supplies___Engine",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The availability of engine supplies is listed. Values are Yes, No, or Unknown.",
    "fields": []
  },
  {
    "name": "Repairs",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "Repairs that can be made to ocean-going vessels are classified as Major (extensive overhauling and rebuilding in well equipped shipyards), Moderate (extensive overhauling and rebuilding that does not require drydocking, or where suitable facilities are lacking or inadequate), Limited (small repair work in independent machine shops or foundries), Emergency Only, None, or Unknown.",
    "fields": []
  },
  {
    "name": "Dry_Dock",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The general size and type of the largest underwater repair facilities in the port are Small (up to 200 meters), Medium (201 - 300 meters), or Large (301 meters and over).",
    "fields": []
  },
  {
    "name": "Railway",
    "mode": "NULLABLE",
    "type": "STRING",
    "description": "The general size and type of the largest underwater repair facilities in the port are Small (up to 200 tons), Medium (201 - 1000 tons), or Large (over 1000 tons).",
    "fields": []
  },
  {
    "name": "Latitude",
    "mode": "REQUIRED",
    "type": "FLOAT",
    "description": "Latitude of the port is given.",
    "fields": []
  },
  {
    "name": "Longitude",
    "mode": "REQUIRED",
    "type": "FLOAT",
    "description": "Longitude of the port is given.",
    "fields": []
  }
]
